# Importing the libraries

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# Importing the dataset

In [2]:
train_data = pd.read_csv('train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
test_data = pd.read_csv('test.csv')
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Training the Random Forest Regression using the training data

In [4]:
from sklearn.ensemble import RandomForestClassifier

y = train_data['Survived']
features = ['Pclass', 'Sex', 'SibSp', 'Parch']
x = pd.get_dummies(train_data[features])
x_test = pd.get_dummies(test_data[features])

In [5]:
regressor = RandomForestClassifier(n_estimators= 100, max_depth= 5, random_state=1)
regressor.fit(x, y)

RandomForestClassifier(max_depth=5, random_state=1)

# Predicting the values

In [6]:
prediction = regressor.predict(x_test)

# Exporting the predicted values in a csv file

In [7]:
output = pd.DataFrame({'PassengerID': test_data.PassengerId,
                     'Survived':prediction})
output.to_csv('submission.csv', index = False)

In [8]:
output.head()

   PassengerID  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [9]:
len(output)

418

In [10]:
submission = pd.read_csv('submission.csv')
submission.head()

   PassengerID  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1